In [1]:
import numpy as np 
import pandas as pd

In [7]:
data = {
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Emily'],
    'Age': [25, np.nan, np.nan, 22, 35],
    'Salary': [50000, 60000, np.nan, 45000, 70000],
    'City': ['New York', 'San Francisco', 'Chicago', np.nan, 'Los Angeles']
}

df = pd.DataFrame(data)
df

    Name   Age   Salary           City
0  Alice  25.0  50000.0       New York
1    Bob   NaN  60000.0  San Francisco
2    NaN   NaN      NaN        Chicago
3  David  22.0  45000.0            NaN
4  Emily  35.0  70000.0    Los Angeles

In [8]:
df.isnull()

    Name    Age  Salary   City
0  False  False   False  False
1  False   True   False  False
2   True   True    True  False
3  False  False   False   True
4  False  False   False  False

In [9]:
df.isnull().sum()

Name      1
Age       2
Salary    1
City      1
dtype: int64

In [15]:
#replace missing values(integer) using interpolation
df_interpolated = df.interpolate(method = 'quadratic')

print("Original dataset:")
print(df)

print("Dataset after replacing missing values:")
df_interpolated

Original dataset:
    Name   Age   Salary           City
0  Alice  25.0  50000.0       New York
1    Bob   NaN  60000.0  San Francisco
2    NaN   NaN      NaN        Chicago
3  David  22.0  45000.0            NaN
4  Emily  35.0  70000.0    Los Angeles
Dataset after replacing missing values:

    Name   Age   Salary           City
0  Alice  25.0  50000.0       New York
1    Bob  17.0  60000.0  San Francisco
2    NaN  16.0  50000.0        Chicago
3  David  22.0  45000.0            NaN
4  Emily  35.0  70000.0    Los Angeles

In [11]:
#replacing categorical values using fillna()
rep_string = 'Unknown'
df_filled = df.fillna(rep_string)

df_filled

      Name      Age   Salary           City
0    Alice     25.0  50000.0       New York
1      Bob  Unknown  60000.0  San Francisco
2  Unknown  Unknown  Unknown        Chicago
3    David     22.0  45000.0        Unknown
4    Emily     35.0  70000.0    Los Angeles